Soar_EnvGen/cfd/cfd_default/Allrun-parallel
#!/bin/sh
cd "${0%/*}" || exit                                # Run from this directory
. ${WM_PROJECT_DIR:?}/bin/tools/RunFunctions        # Tutorial run functions
#------------------------------------------------------------------------------

./Allrun.pre

runApplication decomposePar

restore0Dir -processor

runParallel $(getApplication)

runApplication reconstructPar

#------------------------------------------------------------------------------
